Revit 2026 API

# WireframeBuilderAddPoint Method

---

Add a point to the shape representation stored in this WireframeBuilder.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddPoint(
	Point GPoint
)
```
```vb
Public Sub AddPoint (
	GPoint As Point
)
```
```cpp
public:
void AddPoint(
	Point^ GPoint
)
```
```fsharp
member AddPoint :
        GPoint : Point -> unit
```

#### Parameters

GPoint Point
     The point to be added.

| Exception | Condition |
| --- | --- |
| ArgumentException | GPoint is not acceptable for a wireframe shape representation. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

WireframeBuilder Class

Autodesk.Revit.DB Namespace